
===========================================================================
report_tns
============================================================================
tns -9.32

===========================================================================
report_wns
============================================================================
wns -1.46

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.46

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.15
