
===========================================================================
report_tns
============================================================================
tns -7.35

===========================================================================
report_wns
============================================================================
wns -1.18

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.18

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.15
